java/grammar.org
#+TITLE:     Grammar
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 4
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>


* Stream

** 基本原理

流的使用一般包括三件事:

- 一个数据源（如集合）来执行一个查询
- 一个中间操作链，形成一条流的流水线
- 一个终端操作，执行流水线，并能生成结果


** 示例代码

*** 筛选

**** 谓词筛选

#+BEGIN_SRC java
  List<Dish> vegetarianMenu = menu.stream()
      .filter(Dish::isVegetarian)
      .collect(toList());
#+END_SRC


**** 筛选各异

#+BEGIN_SRC java
  List<Integer> numbers = Arrays.asList(1, 2, 1, 3, 3, 2, 4);
  number.stream()
      .filter(i -> i % 2 == 0)
      .distinct()
      .forEach(System.out::println);
#+END_SRC


**** 截短

#+BEGIN_SRC java
  List<Dish> dishes = menu.stream()
      .filter(d -> d.getCalories() > 300)
      .limit(3)
      .collect(toList());
#+END_SRC

**** 跳过

#+BEGIN_SRC java
  List<Dish> dishes = menu.stream()
      .filter(d -> d.getCalories() > 300)
      .skip(2)
      .collect(toList());
#+END_SRC


*** 映射


**** 基本映射

#+BEGIN_SRC java
  List<String> dishNames = menu.stream()
      .map(Dish::getName)
      .collect(toList());
#+END_SRC

**** 扁平化流

#+BEGIN_SRC java
  List<String> uniqueCharacters =
      words.stream()
      .map(w -> w.split(""))
      .flatMap(Arrays::stream)    // Arrays.stream() 的方法可以接受一个数组并产生一个流
                                  // 将各个生成流扁平化为单个流
      .distinct()
      .collect(Collectors.toList());
#+END_SRC


*** 归约

此类查询需要将流中所有元素反复结合起来，得到一个值。这样的查询可以被归类为归约操作（将流归约成一个值）。

用函数式编程语言的术语来说，这称为折叠（fold），因为你可以将这个操作看成把一张长长的纸（流）反复折叠成一个小方块，而这就是折叠操作的结果。

**** 求和

#+BEGIN_SRC java
  // BinaryOperator<T> 用来将两个元素结合起来产生一个新值
  int sum = numbers.stream().reduce(0, (a, b) -> a + b);
  int sum = numbers.stream().reduce(0, Integer::sum);


  // reduce 还有一个重载的变体，它不接受初始值，但是会返回一个Optional对象
  // 因为流中可能没有任何元素的情况，reduce 操作就无法返回其和，因为它没有初始值
  // 这就是为什么结果被包裹在一个 Optional 对象里，以表明和可能不存在
  Optional<Integer> sum = numbers.stream().reduce((a, b) -> (a + b));
#+END_SRC

**** 计算最大值

#+BEGIN_SRC java
  Optional<Integer> max = numbers.stream().reduce(Integer::max);
#+END_SRC

