java/grammar.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-05 Tue 15:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Grammar</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Grammar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4c07cdf">1. Stream</a>
<ul>
<li><a href="#org89bab75">1.1. 基本原理</a></li>
<li><a href="#org54f7830">1.2. 示例代码</a>
<ul>
<li><a href="#orgffc1f5f">1.2.1. 筛选</a>
<ul>
<li><a href="#orga1c9428">1.2.1.1. 谓词筛选</a></li>
<li><a href="#org04c98e3">1.2.1.2. 筛选各异</a></li>
<li><a href="#org9c7fa90">1.2.1.3. 截短</a></li>
<li><a href="#orge27a094">1.2.1.4. 跳过</a></li>
</ul>
</li>
<li><a href="#org6d9a355">1.2.2. 映射</a>
<ul>
<li><a href="#org31a8066">1.2.2.1. 基本映射</a></li>
<li><a href="#org7434526">1.2.2.2. 扁平化流</a></li>
</ul>
</li>
<li><a href="#orgd08fee0">1.2.3. 归约</a>
<ul>
<li><a href="#orge5d3c88">1.2.3.1. 求和</a></li>
<li><a href="#org1bb8ed8">1.2.3.2. 计算最大值</a></li>
<li><a href="#org489af1f">1.2.3.3. 计算平均值</a></li>
</ul>
</li>
<li><a href="#org9380ad4">1.2.4. 数值流</a></li>
<li><a href="#org8f1b5fa">1.2.5. 构造流</a>
<ul>
<li><a href="#org1e2c93b">1.2.5.1. 由值创建流</a></li>
<li><a href="#org1c23911">1.2.5.2. 由数组创建流</a></li>
<li><a href="#org8c50561">1.2.5.3. 由文件生成流</a></li>
<li><a href="#orge2402b4">1.2.5.4. 由函数生成流 （创建无限流）</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge41f0a4">2. Collection</a>
<ul>
<li><a href="#orgd96ee38">2.1. 基本原理</a>
<ul>
<li><a href="#orgdbf643e">2.1.1. 收集器</a></li>
</ul>
</li>
<li><a href="#org9405303">2.2. 示例代码</a>
<ul>
<li><a href="#orgec911f8">2.2.1. stream 操作</a></li>
<li><a href="#org83ec614">2.2.2. 聚合</a></li>
<li><a href="#org5ee5c59">2.2.3. 分组</a></li>
<li><a href="#org1159091">2.2.4. 分区</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orged76c19">3. Lambda</a>
<ul>
<li><a href="#org5a926c1">3.1. 知识点</a>
<ul>
<li><a href="#org663ca4f">3.1.1. 谓词（Predicate）</a></li>
<li><a href="#org439b29d">3.1.2. 函数式接口（Functional Interface）</a></li>
<li><a href="#org2559485">3.1.3. 常见函数式接口</a></li>
<li><a href="#org99ec167">3.1.4. 方法引用</a></li>
<li><a href="#org1ba5de4">3.1.5. 构造方法引用</a></li>
<li><a href="#orge2e15a8">3.1.6. 类型检查与推断</a></li>
<li><a href="#orgda08c36">3.1.7. 特殊的 void 兼容规则</a></li>
</ul>
</li>
<li><a href="#orgd362c17">3.2. 示例代码</a>
<ul>
<li><a href="#org0a17f77">3.2.1. 方法引用</a></li>
<li><a href="#orgaefdc8d">3.2.2. 构造方法引用</a></li>
<li><a href="#org7dd9917">3.2.3. 排序</a></li>
<li><a href="#orgaeb9ba5">3.2.4. 谓词复合 (negate, and, or)</a></li>
<li><a href="#orgd8f6fe6">3.2.5. 函数复合</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9fd843a">4. Optional</a>
<ul>
<li><a href="#org0492ed8">4.1. 基本原理</a></li>
<li><a href="#orgec382c4">4.2. 代码示例</a>
<ul>
<li><a href="#org71fee27">4.2.1. 类三元操作符</a></li>
<li><a href="#org66a2f78">4.2.2. 避免在 Null 对象上调用 stream()</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4c07cdf">1. Stream</a>
<ul>
<li><a href="#org89bab75">1.1. 基本原理</a></li>
<li><a href="#org54f7830">1.2. 示例代码</a>
<ul>
<li><a href="#orgffc1f5f">1.2.1. 筛选</a>
<ul>
<li><a href="#orga1c9428">1.2.1.1. 谓词筛选</a></li>
<li><a href="#org04c98e3">1.2.1.2. 筛选各异</a></li>
<li><a href="#org9c7fa90">1.2.1.3. 截短</a></li>
<li><a href="#orge27a094">1.2.1.4. 跳过</a></li>
</ul>
</li>
<li><a href="#org6d9a355">1.2.2. 映射</a>
<ul>
<li><a href="#org31a8066">1.2.2.1. 基本映射</a></li>
<li><a href="#org7434526">1.2.2.2. 扁平化流</a></li>
</ul>
</li>
<li><a href="#orgd08fee0">1.2.3. 归约</a>
<ul>
<li><a href="#orge5d3c88">1.2.3.1. 求和</a></li>
<li><a href="#org1bb8ed8">1.2.3.2. 计算最大值</a></li>
<li><a href="#org489af1f">1.2.3.3. 计算平均值</a></li>
</ul>
</li>
<li><a href="#org9380ad4">1.2.4. 数值流</a></li>
<li><a href="#org8f1b5fa">1.2.5. 构造流</a>
<ul>
<li><a href="#org1e2c93b">1.2.5.1. 由值创建流</a></li>
<li><a href="#org1c23911">1.2.5.2. 由数组创建流</a></li>
<li><a href="#org8c50561">1.2.5.3. 由文件生成流</a></li>
<li><a href="#orge2402b4">1.2.5.4. 由函数生成流 （创建无限流）</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge41f0a4">2. Collection</a>
<ul>
<li><a href="#orgd96ee38">2.1. 基本原理</a>
<ul>
<li><a href="#orgdbf643e">2.1.1. 收集器</a></li>
</ul>
</li>
<li><a href="#org9405303">2.2. 示例代码</a>
<ul>
<li><a href="#orgec911f8">2.2.1. stream 操作</a></li>
<li><a href="#org83ec614">2.2.2. 聚合</a></li>
<li><a href="#org5ee5c59">2.2.3. 分组</a></li>
<li><a href="#org1159091">2.2.4. 分区</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orged76c19">3. Lambda</a>
<ul>
<li><a href="#org5a926c1">3.1. 知识点</a>
<ul>
<li><a href="#org663ca4f">3.1.1. 谓词（Predicate）</a></li>
<li><a href="#org439b29d">3.1.2. 函数式接口（Functional Interface）</a></li>
<li><a href="#org2559485">3.1.3. 常见函数式接口</a></li>
<li><a href="#org99ec167">3.1.4. 方法引用</a></li>
<li><a href="#org1ba5de4">3.1.5. 构造方法引用</a></li>
<li><a href="#orge2e15a8">3.1.6. 类型检查与推断</a></li>
<li><a href="#orgda08c36">3.1.7. 特殊的 void 兼容规则</a></li>
</ul>
</li>
<li><a href="#orgd362c17">3.2. 示例代码</a>
<ul>
<li><a href="#org0a17f77">3.2.1. 方法引用</a></li>
<li><a href="#orgaefdc8d">3.2.2. 构造方法引用</a></li>
<li><a href="#org7dd9917">3.2.3. 排序</a></li>
<li><a href="#orgaeb9ba5">3.2.4. 谓词复合 (negate, and, or)</a></li>
<li><a href="#orgd8f6fe6">3.2.5. 函数复合</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9fd843a">4. Optional</a>
<ul>
<li><a href="#org0492ed8">4.1. 基本原理</a></li>
<li><a href="#orgec382c4">4.2. 代码示例</a>
<ul>
<li><a href="#org71fee27">4.2.1. 类三元操作符</a></li>
<li><a href="#org66a2f78">4.2.2. 避免在 Null 对象上调用 stream()</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-05 15:51:28</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org4c07cdf" class="outline-2">
<h2 id="org4c07cdf"><span class="section-number-2">1</span> Stream</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org89bab75" class="outline-3">
<h3 id="org89bab75"><span class="section-number-3">1.1</span> 基本原理</h3>
<div class="outline-text-3" id="text-1-1">
<p>
流的使用一般包括三件事:
</p>

<ul class="org-ul">
<li>一个数据源（如集合）来执行一个查询</li>
<li>一个中间操作链，形成一条流的流水线</li>
<li>一个终端操作，执行流水线，并能生成结果</li>
</ul>
</div>
</div>


<div id="outline-container-org54f7830" class="outline-3">
<h3 id="org54f7830"><span class="section-number-3">1.2</span> 示例代码</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgffc1f5f" class="outline-4">
<h4 id="orgffc1f5f"><span class="section-number-4">1.2.1</span> 筛选</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<div id="outline-container-orga1c9428" class="outline-5">
<h5 id="orga1c9428"><span class="section-number-5">1.2.1.1</span> 谓词筛选</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">vegetarianMenu</span> = menu.stream()
    .filter(Dish::isVegetarian)
    .collect(toList());
</pre>
</div>
</div>
</div>


<div id="outline-container-org04c98e3" class="outline-5">
<h5 id="org04c98e3"><span class="section-number-5">1.2.1.2</span> 筛选各异</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">numbers</span> = Arrays.asList(1, 2, 1, 3, 3, 2, 4);
number.stream()
    .filter(i -&gt; i % 2 == 0)
    .distinct()
    .forEach(System.out::println);
</pre>
</div>
</div>
</div>


<div id="outline-container-org9c7fa90" class="outline-5">
<h5 id="org9c7fa90"><span class="section-number-5">1.2.1.3</span> 截短</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">dishes</span> = menu.stream()
    .filter(d -&gt; d.getCalories() &gt; 300)
    .limit(3)
    .collect(toList());
</pre>
</div>
</div>
</div>

<div id="outline-container-orge27a094" class="outline-5">
<h5 id="orge27a094"><span class="section-number-5">1.2.1.4</span> 跳过</h5>
<div class="outline-text-5" id="text-1-2-1-4">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">dishes</span> = menu.stream()
    .filter(d -&gt; d.getCalories() &gt; 300)
    .skip(2)
    .collect(toList());
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org6d9a355" class="outline-4">
<h4 id="org6d9a355"><span class="section-number-4">1.2.2</span> 映射</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<div id="outline-container-org31a8066" class="outline-5">
<h5 id="org31a8066"><span class="section-number-5">1.2.2.1</span> 基本映射</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">dishNames</span> = menu.stream()
    .map(Dish::getName)
    .collect(toList());
</pre>
</div>
</div>
</div>

<div id="outline-container-org7434526" class="outline-5">
<h5 id="org7434526"><span class="section-number-5">1.2.2.2</span> 扁平化流</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">uniqueCharacters</span> =
    words.stream()
    .map(w -&gt; w.split(<span style="color: #00afaf;">""</span>))
    .flatMap(Arrays::stream)    <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">Arrays.stream() &#30340;&#26041;&#27861;&#21487;&#20197;&#25509;&#21463;&#19968;&#20010;&#25968;&#32452;&#24182;&#20135;&#29983;&#19968;&#20010;&#27969;</span>
                                <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#23558;&#21508;&#20010;&#29983;&#25104;&#27969;&#25153;&#24179;&#21270;&#20026;&#21333;&#20010;&#27969;</span>
    .distinct()
    .collect(Collectors.toList());
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd08fee0" class="outline-4">
<h4 id="orgd08fee0"><span class="section-number-4">1.2.3</span> 归约</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
此类查询需要将流中所有元素反复结合起来，得到一个值。这样的查询可以被归类为归约操作（将流归约成一个值）。
</p>

<p>
用函数式编程语言的术语来说，这称为折叠（fold），因为你可以将这个操作看成把一张长长的纸（流）反复折叠成一个小方块，而这就是折叠操作的结果。
</p>
</div>

<div id="outline-container-orge5d3c88" class="outline-5">
<h5 id="orge5d3c88"><span class="section-number-5">1.2.3.1</span> 求和</h5>
<div class="outline-text-5" id="text-1-2-3-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">BinaryOperator&lt;T&gt; &#29992;&#26469;&#23558;&#20004;&#20010;&#20803;&#32032;&#32467;&#21512;&#36215;&#26469;&#20135;&#29983;&#19968;&#20010;&#26032;&#20540;</span>
<span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = numbers.stream().reduce(0, (a, b) -&gt; a + b);
<span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = numbers.stream().reduce(0, Integer::sum);


<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">reduce &#36824;&#26377;&#19968;&#20010;&#37325;&#36733;&#30340;&#21464;&#20307;&#65292;&#23427;&#19981;&#25509;&#21463;&#21021;&#22987;&#20540;&#65292;&#20294;&#26159;&#20250;&#36820;&#22238;&#19968;&#20010;Optional&#23545;&#35937;</span>
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#22240;&#20026;&#27969;&#20013;&#21487;&#33021;&#27809;&#26377;&#20219;&#20309;&#20803;&#32032;&#30340;&#24773;&#20917;&#65292;reduce &#25805;&#20316;&#23601;&#26080;&#27861;&#36820;&#22238;&#20854;&#21644;&#65292;&#22240;&#20026;&#23427;&#27809;&#26377;&#21021;&#22987;&#20540;</span>
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#32467;&#26524;&#34987;&#21253;&#35065;&#22312;&#19968;&#20010; Optional &#23545;&#35937;&#37324;&#65292;&#20197;&#34920;&#26126;&#21644;&#21487;&#33021;&#19981;&#23384;&#22312;</span>
<span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">sum</span> = numbers.stream().reduce((a, b) -&gt; (a + b));
</pre>
</div>
</div>
</div>
