java/grammar.org
**** 计算平均值

#+BEGIN_SRC java
  double avgCalories = menu.stream().collect(averagingInt(Dish::getCalories));
#+END_SRC


*** 数值流

=IntStream= 中的 =map= 方法只能为流中的每个元素返回另一个 =int= ，
如果这不是你想要的，可以用 =IntStream= 的 =mapToObj= 方法改写它，这个方法会返回一个对象值流。

或者使用 =boxed= 方法先转换为 =Stream<Integer>= 。

#+BEGIN_SRC java
  IntStream evenNumbers = IntStream.range(1, 100);
  IntStream evenNumbers = IntStream.rangeClosed(1, 100);
#+END_SRC


*** 构造流

**** 由值创建流

#+BEGIN_SRC java
  Stream<String> stream = Stream.of("Java 8 ", "Lambdas ", "In ", "Action");
  Stream<String> emptyStream = Stream.empty();
#+END_SRC


**** 由数组创建流

#+BEGIN_SRC java
  int[] numbers = {2, 3, 5, 7, 11, 13};
  int sum = Arrays.stream(numbers).sum();
#+END_SRC

**** 由文件生成流

#+BEGIN_SRC java
  Stream<String> lines = Files.lines(Paths.get("data.txt"), Charset.defaultCharset());
#+END_SRC

**** 由函数生成流 （创建无限流）

Stream API 提供了两个静态方法来从函数生成流: =Stream.iterate= 和 =Stream.generate= ，这两个操作可以创建所谓的无限流，

由 =iterate= 和 =generate= 产生的流会用给定的函数按需创建值，因此可以无穷无尽地计算下去。
一般来说，应该使用 =limit(n)= 来对这种流加以限制，以避免打印无穷多个值。

#+BEGIN_SRC java
  Stream.iterate(0, n -> n + 2)
      .limit(10)
      .forEach(System.out::println);

  Stream.generate(Math::random)
      .limit(5)
      .forEach(System.out::println);

  IntStream ones = IntStream.generate(() -> 1);

#+END_SRC















* Collection

** 基本原理

***  收集器

即 Collectors 类提供的工厂方法（例如 groupingBy )所创建的对象。主要提供三个功能:

- 将流元素归约和汇总为一个值
- 元素分组
- 元素分区



