java/grammar.html

<div id="outline-container-org1bb8ed8" class="outline-5">
<h5 id="org1bb8ed8"><span class="section-number-5">1.2.3.2</span> 计算最大值</h5>
<div class="outline-text-5" id="text-1-2-3-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">max</span> = numbers.stream().reduce(Integer::max);
</pre>
</div>
</div>
</div>

<div id="outline-container-org489af1f" class="outline-5">
<h5 id="org489af1f"><span class="section-number-5">1.2.3.3</span> 计算平均值</h5>
<div class="outline-text-5" id="text-1-2-3-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">double</span> <span style="color: #0087ff;">avgCalories</span> = menu.stream().collect(averagingInt(Dish::getCalories));
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org9380ad4" class="outline-4">
<h4 id="org9380ad4"><span class="section-number-4">1.2.4</span> 数值流</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<code>IntStream</code> 中的 <code>map</code> 方法只能为流中的每个元素返回另一个 <code>int</code> ，
如果这不是你想要的，可以用 <code>IntStream</code> 的 <code>mapToObj</code> 方法改写它，这个方法会返回一个对象值流。
</p>

<p>
或者使用 <code>boxed</code> 方法先转换为 <code>Stream&lt;Integer&gt;</code> 。
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">IntStream</span> <span style="color: #0087ff;">evenNumbers</span> = IntStream.range(1, 100);
<span style="color: #af8700;">IntStream</span> <span style="color: #0087ff;">evenNumbers</span> = IntStream.rangeClosed(1, 100);
</pre>
</div>
</div>
</div>


<div id="outline-container-org8f1b5fa" class="outline-4">
<h4 id="org8f1b5fa"><span class="section-number-4">1.2.5</span> 构造流</h4>
<div class="outline-text-4" id="text-1-2-5">
</div>
<div id="outline-container-org1e2c93b" class="outline-5">
<h5 id="org1e2c93b"><span class="section-number-5">1.2.5.1</span> 由值创建流</h5>
<div class="outline-text-5" id="text-1-2-5-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Stream</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">stream</span> = Stream.of(<span style="color: #00afaf;">"Java 8 "</span>, <span style="color: #00afaf;">"Lambdas "</span>, <span style="color: #00afaf;">"In "</span>, <span style="color: #00afaf;">"Action"</span>);
<span style="color: #af8700;">Stream</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">emptyStream</span> = Stream.empty();
</pre>
</div>
</div>
</div>


<div id="outline-container-org1c23911" class="outline-5">
<h5 id="org1c23911"><span class="section-number-5">1.2.5.2</span> 由数组创建流</h5>
<div class="outline-text-5" id="text-1-2-5-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">int</span>[] <span style="color: #0087ff;">numbers</span> = {2, 3, 5, 7, 11, 13};
<span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = Arrays.stream(numbers).sum();
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c50561" class="outline-5">
<h5 id="org8c50561"><span class="section-number-5">1.2.5.3</span> 由文件生成流</h5>
<div class="outline-text-5" id="text-1-2-5-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Stream</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">lines</span> = Files.lines(Paths.get(<span style="color: #00afaf;">"data.txt"</span>), Charset.defaultCharset());
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2402b4" class="outline-5">
<h5 id="orge2402b4"><span class="section-number-5">1.2.5.4</span> 由函数生成流 （创建无限流）</h5>
<div class="outline-text-5" id="text-1-2-5-4">
<p>
Stream API 提供了两个静态方法来从函数生成流: <code>Stream.iterate</code> 和 <code>Stream.generate</code> ，这两个操作可以创建所谓的无限流，
</p>

<p>
由 <code>iterate</code> 和 <code>generate</code> 产生的流会用给定的函数按需创建值，因此可以无穷无尽地计算下去。
一般来说，应该使用 <code>limit(n)</code> 来对这种流加以限制，以避免打印无穷多个值。
</p>

<div class="org-src-container">
<pre class="src src-java">Stream.iterate(0, n -&gt; n + 2)
    .limit(10)
    .forEach(System.out::println);

Stream.generate(Math::random)
    .limit(5)
    .forEach(System.out::println);

<span style="color: #af8700;">IntStream</span> <span style="color: #0087ff;">ones</span> = IntStream.generate(() -&gt; 1);

</pre>
</div>
</div>
</div>
</div>
</div>
</div>















<div id="outline-container-orge41f0a4" class="outline-2">
<h2 id="orge41f0a4"><span class="section-number-2">2</span> Collection</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd96ee38" class="outline-3">
<h3 id="orgd96ee38"><span class="section-number-3">2.1</span> 基本原理</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgdbf643e" class="outline-4">
<h4 id="orgdbf643e"><span class="section-number-4">2.1.1</span> 收集器</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
即 Collectors 类提供的工厂方法（例如 groupingBy )所创建的对象。主要提供三个功能:
</p>

<ul class="org-ul">
<li>将流元素归约和汇总为一个值</li>
<li>元素分组</li>
<li>元素分区</li>
</ul>
</div>
</div>
</div>
