java/grammar.org
** 示例代码

#+BEGIN_SRC java
  import static java.util.Comparator.*;
  import static java.util.stream.Collectors.*;

  @AllArgsConstructor
  class Dish {

      @Getter private final String name;
      @Getter private final boolean vegetarian;
      @Getter private final int calories;
      @Getter private final Type type;

      public enum Type { MEAT, FISH, OTHER }

      public enum CaloricLevel { DIET, NORMAL, FAT }
  }


  public static List<Dish> menu =
      Arrays.asList(new Dish("pork", false, 800, Dish.Type.MEAT),
                    new Dish("beef", false, 700, Dish.Type.MEAT),
                    new Dish("chicken", false, 400, Dish.Type.MEAT),
                    new Dish("french fries", true, 530, Dish.Type.OTHER),
                    new Dish("rice", true, 350, Dish.Type.OTHER),
                    new Dish("season fruit", true, 120, Dish.Type.OTHER),
                    new Dish("pizza", true, 550, Dish.Type.OTHER),
                    new Dish("prawns", false, 300, Dish.Type.FISH),
                    new Dish("salmon", false, 450, Dish.Type.FISH));



  public static void getThreeHighCaloricDishNames() {
      menu.stream()
          .sorted(comparing(Dish::getCalories).reversed())
          .limit(3)
          .map(d -> d.getName())
          .forEach(System.out::println);
  }

  public static void getDistinctDishType() {
      menu.stream()
          .map(d -> d.getType())
          .distinct()
          .forEach(System.out::println);
  }

  public static void getAllCalories0() {
      int sum = menu.stream()
          .map(Dish::getCalories)
          .reduce(0, Integer::sum);
      System.out.println(sum);
  }

  public static void getAllCalories1() {
      int sum = menu.stream()
          .mapToInt(Dish::getCalories)
          .sum();
      System.out.println(sum);
  }

  public static void getMaxCalorie() {
      Optional<Integer> maxOp = menu.stream()
          .map(Dish::getCalories)
          .reduce(Integer::max);
      System.out.println(maxOp.orElse(0));
  }

  public static void getMaxCalorieDish() {
      Optional<Dish> maxOp = menu.stream()
          .collect(maxBy(comparingInt(Dish::getCalories)));
      maxOp.ifPresent(System.out::println);
  }

  public static void getTotalNumberOfDish() {
      long total = menu.stream()
          .collect(counting());
      System.out.println(total);
  }

  public static void getAllCalories2() {
      int sum = menu.stream()
          .collect(summingInt(Dish::getCalories));
      System.out.println(sum);
  }

  public static void getAverageCalorie() {
      double avg = menu.stream()
          .collect(averagingInt(Dish::getCalories));
      System.out.println(avg);
  }

  public static void getStatistics() {
      IntSummaryStatistics s = menu.stream()
          .collect(summarizingInt(Dish::getCalories));
      System.out.println(s);
  }

  public static void getShortMenu() {
      String j = menu.stream()
          .map(Dish::getName)
          .collect(joining(", "));
      System.out.println(j);
  }

  public static void groupByCaloricLevel() {
      Map<Dish.CaloricLevel, List<Dish>> dishesByCaloricLevel =
          menu.stream().collect( groupingBy(dish -> {
                      if (dish.getCalories() <= 400)
                          return Dish.CaloricLevel.DIET;
                      else if (dish.getCalories() <= 700)
                          return Dish.CaloricLevel.NORMAL;
                      else
                          return Dish.CaloricLevel.FAT;
                  } ));
      System.out.println(dishesByCaloricLevel);
  }

  public static void groupByDishesAndTypeCaloricLevel() {
      Map<Dish.Type, Map<Dish.CaloricLevel, List<Dish>>> dishesByTypeCaloricLevel =
          menu.stream()
          .collect(groupingBy(Dish::getType,
                              groupingBy(dish -> {
                                      if (dish.getCalories() <= 400)
                                          return Dish.CaloricLevel.DIET;
                                      else if (dish.getCalories() <= 700)
                                          return Dish.CaloricLevel.NORMAL;
                                      else
                                          return Dish.CaloricLevel.FAT;
                                  }  )
                              )
                   );
      System.out.println(dishesByTypeCaloricLevel);
  }

  public static void getTotalNumberOfDishByType() {
      Map<Dish.Type,Long> typesCount =
          menu.stream()
          .collect(groupingBy(Dish::getType,
                              counting()));
      System.out.println(typesCount);
  }

  public static void getMostCaloricByType0() {
      Map<Dish.Type, Optional<Dish>> mostCaloricByType =
          menu.stream()
          .collect(groupingBy(Dish::getType,
                              maxBy(comparingInt(Dish::getCalories))));
      System.out.println(mostCaloricByType);
  }

  public static void getMostCaloricByType1() {
      Map<Dish.Type, Dish> mostCaloricByType =
          menu.stream()
          .collect(groupingBy(Dish::getType,
                              collectingAndThen(maxBy(comparingInt(Dish::getCalories)),
                                                Optional::get)
                              ));
      System.out.println(mostCaloricByType);
  }

  public static void getCaloricLevelsByType() {
      Map<Dish.Type, Set<Dish.CaloricLevel>> caloricLevelsByType =
          menu.stream().collect(groupingBy(Dish::getType,
                                           mapping( dish -> {
                                                   if (dish.getCalories() <= 400)
                                                       return Dish.CaloricLevel.DIET;
                                                   else if (dish.getCalories() <= 700)
                                                       return Dish.CaloricLevel.NORMAL;
                                                   else
                                                       return Dish.CaloricLevel.FAT;
                                               },
                                               toSet())));
      System.out.println(caloricLevelsByType);
  }

  public static void getCaloricLevelsByType1() {
      Map<Dish.Type, Set<Dish.CaloricLevel>> caloricLevelsByType =
          menu.stream().collect(groupingBy(Dish::getType,
                                           mapping( dish -> {
                                                   if (dish.getCalories() <= 400)
                                                       return Dish.CaloricLevel.DIET;
                                                   else if (dish.getCalories() <= 700)
                                                       return Dish.CaloricLevel.NORMAL;
                                                   else
                                                       return Dish.CaloricLevel.FAT;
                                               },
                                               toCollection(HashSet::new))));
      System.out.println(caloricLevelsByType);
  }

  public static void getTotalCaloriesByType() {
      Map<Dish.Type, Integer> totalCaloriesByType =
          menu.stream().collect(groupingBy(Dish::getType,
                                           summingInt(Dish::getCalories)));
      System.out.println(totalCaloriesByType);
  }

  public static void getVegetarianDishes() {
      Map<Boolean, List<Dish>> partitionedMenu =
          menu.stream().collect(partitioningBy(Dish::isVegetarian));
      System.out.println(partitionedMenu.get(true));
  }

  public static void getMostCaloricPartitionedByVegetarian() {
      Map<Boolean, String> mostCaloricPartitionedByVegetarian =
          menu.stream().collect(partitioningBy(Dish::isVegetarian,
                                               collectingAndThen(maxBy(comparingInt(Dish::getCalories)),
                                                                 op -> op.get().getName())));
      System.out.println(mostCaloricPartitionedByVegetarian);
  }




#+END_SRC


