java/grammar.html



<div id="outline-container-org9405303" class="outline-3">
<h3 id="org9405303"><span class="section-number-3">2.2</span> 示例代码</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5f8700;">import</span> <span style="color: #5f8700;">static</span> <span style="color: #00afaf;">java</span>.<span style="color: #00afaf;">util</span>.<span style="color: #00afaf;">Comparator</span>.*;
<span style="color: #5f8700;">import</span> <span style="color: #5f8700;">static</span> <span style="color: #00afaf;">java</span>.<span style="color: #00afaf;">util</span>.<span style="color: #00afaf;">stream</span>.<span style="color: #00afaf;">Collectors</span>.*;

<span style="color: #00afaf;">@AllArgsConstructor</span>
<span style="color: #5f8700;">class</span> <span style="color: #af8700;">Dish</span> {

    <span style="color: #00afaf;">@Getter</span> <span style="color: #5f8700;">private</span> <span style="color: #5f8700;">final</span> <span style="color: #af8700;">String</span> <span style="color: #0087ff;">name</span>;
    <span style="color: #00afaf;">@Getter</span> <span style="color: #5f8700;">private</span> <span style="color: #5f8700;">final</span> <span style="color: #af8700;">boolean</span> <span style="color: #0087ff;">vegetarian</span>;
    <span style="color: #00afaf;">@Getter</span> <span style="color: #5f8700;">private</span> <span style="color: #5f8700;">final</span> <span style="color: #af8700;">int</span> <span style="color: #0087ff;">calories</span>;
    <span style="color: #00afaf;">@Getter</span> <span style="color: #5f8700;">private</span> <span style="color: #5f8700;">final</span> <span style="color: #af8700;">Type</span> <span style="color: #0087ff;">type</span>;

    <span style="color: #5f8700;">public</span> <span style="color: #5f8700;">enum</span> <span style="color: #af8700;">Type</span> { <span style="color: #0087ff;">MEAT</span>, <span style="color: #0087ff;">FISH</span>, <span style="color: #0087ff;">OTHER</span> }

    <span style="color: #5f8700;">public</span> <span style="color: #5f8700;">enum</span> <span style="color: #af8700;">CaloricLevel</span> { <span style="color: #0087ff;">DIET</span>, <span style="color: #0087ff;">NORMAL</span>, <span style="color: #0087ff;">FAT</span> }
}


<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">menu</span> =
    Arrays.asList(<span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"pork"</span>, <span style="color: #00afaf;">false</span>, 800, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.MEAT),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"beef"</span>, <span style="color: #00afaf;">false</span>, 700, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.MEAT),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"chicken"</span>, <span style="color: #00afaf;">false</span>, 400, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.MEAT),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"french fries"</span>, <span style="color: #00afaf;">true</span>, 530, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.OTHER),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"rice"</span>, <span style="color: #00afaf;">true</span>, 350, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.OTHER),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"season fruit"</span>, <span style="color: #00afaf;">true</span>, 120, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.OTHER),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"pizza"</span>, <span style="color: #00afaf;">true</span>, 550, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.OTHER),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"prawns"</span>, <span style="color: #00afaf;">false</span>, 300, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.FISH),
                  <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Dish</span>(<span style="color: #00afaf;">"salmon"</span>, <span style="color: #00afaf;">false</span>, 450, <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">Type</span>.FISH));



<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getThreeHighCaloricDishNames</span>() {
    menu.stream()
        .sorted(comparing(Dish::getCalories).reversed())
        .limit(3)
        .map(d -&gt; d.getName())
        .forEach(System.out::println);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getDistinctDishType</span>() {
    menu.stream()
        .map(d -&gt; d.getType())
        .distinct()
        .forEach(System.out::println);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getAllCalories0</span>() {
    <span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = menu.stream()
        .map(Dish::getCalories)
        .reduce(0, Integer::sum);
    System.out.println(sum);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getAllCalories1</span>() {
    <span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = menu.stream()
        .mapToInt(Dish::getCalories)
        .sum();
    System.out.println(sum);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getMaxCalorie</span>() {
    <span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">maxOp</span> = menu.stream()
        .map(Dish::getCalories)
        .reduce(Integer::max);
    System.out.println(maxOp.orElse(0));
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getMaxCalorieDish</span>() {
    <span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">maxOp</span> = menu.stream()
        .collect(maxBy(comparingInt(Dish::getCalories)));
    maxOp.ifPresent(System.out::println);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getTotalNumberOfDish</span>() {
    <span style="color: #af8700;">long</span> <span style="color: #0087ff;">total</span> = menu.stream()
        .collect(counting());
    System.out.println(total);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getAllCalories2</span>() {
    <span style="color: #af8700;">int</span> <span style="color: #0087ff;">sum</span> = menu.stream()
        .collect(summingInt(Dish::getCalories));
    System.out.println(sum);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getAverageCalorie</span>() {
    <span style="color: #af8700;">double</span> <span style="color: #0087ff;">avg</span> = menu.stream()
        .collect(averagingInt(Dish::getCalories));
    System.out.println(avg);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getStatistics</span>() {
    <span style="color: #af8700;">IntSummaryStatistics</span> <span style="color: #0087ff;">s</span> = menu.stream()
        .collect(summarizingInt(Dish::getCalories));
    System.out.println(s);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getShortMenu</span>() {
    <span style="color: #af8700;">String</span> <span style="color: #0087ff;">j</span> = menu.stream()
        .map(Dish::getName)
        .collect(joining(<span style="color: #00afaf;">", "</span>));
    System.out.println(j);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">groupByCaloricLevel</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">CaloricLevel</span>, <span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt;&gt; <span style="color: #0087ff;">dishesByCaloricLevel</span> =
        menu.stream().collect( groupingBy(dish -&gt; {
                    <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 400)
                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.DIET;
                    <span style="color: #5f8700;">else</span> <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 700)
                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.NORMAL;
                    <span style="color: #5f8700;">else</span>
                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.FAT;
                } ));
    System.out.println(dishesByCaloricLevel);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">groupByDishesAndTypeCaloricLevel</span>() {
    Map&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">CaloricLevel</span>, <span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt;&gt;&gt; <span style="color: #af8700;">dishesByTypeCaloricLevel</span> =
        menu.stream()
        .collect(groupingBy(Dish::getType,
                            groupingBy(dish -&gt; {
                                    <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 400)
                                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.DIET;
                                    <span style="color: #5f8700;">else</span> <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 700)
                                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.NORMAL;
                                    <span style="color: #5f8700;">else</span>
                                        <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.FAT;
                                }  )
                            )
                 );
    System.out.println(dishesByTypeCaloricLevel);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getTotalNumberOfDishByType</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>,<span style="color: #af8700;">Long</span>&gt; <span style="color: #0087ff;">typesCount</span> =
        menu.stream()
        .collect(groupingBy(Dish::getType,
                            counting()));
    System.out.println(typesCount);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getMostCaloricByType0</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Dish</span>&gt;&gt; <span style="color: #0087ff;">mostCaloricByType</span> =
        menu.stream()
        .collect(groupingBy(Dish::getType,
                            maxBy(comparingInt(Dish::getCalories))));
    System.out.println(mostCaloricByType);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getMostCaloricByType1</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Dish</span>&gt; <span style="color: #0087ff;">mostCaloricByType</span> =
        menu.stream()
        .collect(groupingBy(Dish::getType,
                            collectingAndThen(maxBy(comparingInt(Dish::getCalories)),
                                              Optional::get)
                            ));
    System.out.println(mostCaloricByType);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getCaloricLevelsByType</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Set</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">CaloricLevel</span>&gt;&gt; <span style="color: #0087ff;">caloricLevelsByType</span> =
        menu.stream().collect(groupingBy(Dish::getType,
                                         mapping( dish -&gt; {
                                                 <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 400)
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.DIET;
                                                 <span style="color: #5f8700;">else</span> <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 700)
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.NORMAL;
                                                 <span style="color: #5f8700;">else</span>
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.FAT;
                                             },
                                             toSet())));
    System.out.println(caloricLevelsByType);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getCaloricLevelsByType1</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Set</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">CaloricLevel</span>&gt;&gt; <span style="color: #0087ff;">caloricLevelsByType</span> =
        menu.stream().collect(groupingBy(Dish::getType,
                                         mapping( dish -&gt; {
                                                 <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 400)
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.DIET;
                                                 <span style="color: #5f8700;">else</span> <span style="color: #5f8700;">if</span> (dish.getCalories() &lt;= 700)
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.NORMAL;
                                                 <span style="color: #5f8700;">else</span>
                                                     <span style="color: #5f8700;">return</span> <span style="color: #00afaf;">Dish</span>.<span style="color: #00afaf;">CaloricLevel</span>.FAT;
                                             },
                                             toCollection(HashSet::<span style="color: #5f8700;">new</span>))));
    System.out.println(caloricLevelsByType);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getTotalCaloriesByType</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #00afaf;">Dish</span>.<span style="color: #af8700;">Type</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">totalCaloriesByType</span> =
        menu.stream().collect(groupingBy(Dish::getType,
                                         summingInt(Dish::getCalories)));
    System.out.println(totalCaloriesByType);
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getVegetarianDishes</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #af8700;">Boolean</span>, <span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">Dish</span>&gt;&gt; <span style="color: #0087ff;">partitionedMenu</span> =
        menu.stream().collect(partitioningBy(Dish::isVegetarian));
    System.out.println(partitionedMenu.get(<span style="color: #00afaf;">true</span>));
}

<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">getMostCaloricPartitionedByVegetarian</span>() {
    <span style="color: #af8700;">Map</span>&lt;<span style="color: #af8700;">Boolean</span>, <span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">mostCaloricPartitionedByVegetarian</span> =
        menu.stream().collect(partitioningBy(Dish::isVegetarian,
                                             collectingAndThen(maxBy(comparingInt(Dish::getCalories)),
                                                               op -&gt; op.get().getName())));
    System.out.println(mostCaloricPartitionedByVegetarian);
}




</pre>
</div>
</div>
