java/grammar.org
*** stream 操作

#+BEGIN_SRC java
  System.out.println("===== getThreeHighCaloricDishNames (sort) =====");
  getThreeHighCaloricDishNames();
  System.out.println("===== getDistinctDishType (distinct) =====");
  getDistinctDishType();
  System.out.println("===== getAllCalories (reduce) =====");
  getAllCalories0();
  System.out.println("===== getAllCalories (mapToInt) =====");
  getAllCalories1();
  System.out.println("===== getMaxCalorie (reduce) =====");
  getMaxCalorie();
#+END_SRC

#+BEGIN_EXAMPLE
===== getThreeHighCaloricDishNames (sort) =====
pork
beef
pizza
===== getDistinctDishType (distinct) =====
MEAT
OTHER
FISH
===== getAllCalories (reduce) =====
4200
===== getAllCalories (mapToInt) =====
4200
===== getMaxCalorie (reduce) =====
800
#+END_EXAMPLE


*** 聚合

#+BEGIN_SRC java
  System.out.println("===== getTotalNumberOfDish (counting) =====");
  getTotalNumberOfDish();
  System.out.println("===== getMaxCalorie (maxBy) =====");
  getMaxCalorieDish();
  System.out.println("===== getAllCalories (summingInt) =====");
  getAllCalories2();
  System.out.println("===== getAverageCalorie (averagingInt) =====");
  getAverageCalorie();
  System.out.println("===== getStatistics (summarizingInt) =====");
  getStatistics();
  System.out.println("===== getShortMenu (joining) =====");
  getShortMenu();
#+END_SRC

#+BEGIN_EXAMPLE
===== getTotalNumberOfDish (counting) =====
9
===== getMaxCalorie (maxBy) =====
com.cisco.ruan.nio.Dish@27bc2616
===== getAllCalories (summingInt) =====
4200
===== getAverageCalorie (averagingInt) =====
466.6666666666667
===== getStatistics (summarizingInt) =====
IntSummaryStatistics{count=9, sum=4200, min=120, average=466.666667, max=800}
===== getShortMenu (joining) =====
pork, beef, chicken, french fries, rice, season fruit, pizza, prawns, salmon
#+END_EXAMPLE


*** 分组

#+BEGIN_SRC java
  System.out.println("===== groupByCaloricLevel (groupingBy) =====");
  groupByCaloricLevel();
  System.out.println("===== groupByDishesAndTypeCaloricLevel (multi-level groupingBy) =====");
  groupByDishesAndTypeCaloricLevel();
  System.out.println("===== groupByDishesAndTypeCaloricLevel (counting on substream) =====");
  getTotalNumberOfDishByType();
  System.out.println("===== getMostCaloricByType (maxBy on substream) =====");
  getMostCaloricByType0();
  System.out.println("===== getMostCaloricByType (collectingAndThen) =====");
  getMostCaloricByType1();
  System.out.println("===== getTotalCaloriesByType (summingInt on substream) =====");
  getTotalCaloriesByType();
  System.out.println("===== getCaloricLevelsByType (mapping on substream and collect in set) =====");
  getCaloricLevelsByType();
  System.out.println("===== getCaloricLevelsByType (mapping on substream and collect in hashset) =====");
  getCaloricLevelsByType1();
#+END_SRC

#+BEGIN_EXAMPLE
===== groupByCaloricLevel (groupingBy) =====
{NORMAL=[com.cisco.ruan.nio.Dish@179d3b25, com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@5d099f62, com.cisco.ruan.nio.Dish@37f8bb67], DIET=[com.cisco.ruan.nio.Dish@49c2faae, com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0, com.cisco.ruan.nio.Dish@439f5b3d], FAT=[com.cisco.ruan.nio.Dish@27bc2616]}
===== groupByDishesAndTypeCaloricLevel (multi-level groupingBy) =====
{OTHER={NORMAL=[com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@5d099f62], DIET=[com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0]}, FISH={NORMAL=[com.cisco.ruan.nio.Dish@37f8bb67], DIET=[com.cisco.ruan.nio.Dish@439f5b3d]}, MEAT={NORMAL=[com.cisco.ruan.nio.Dish@179d3b25], DIET=[com.cisco.ruan.nio.Dish@49c2faae], FAT=[com.cisco.ruan.nio.Dish@27bc2616]}}
===== groupByDishesAndTypeCaloricLevel (counting on substream) =====
{OTHER=4, FISH=2, MEAT=3}
===== getMostCaloricByType (maxBy on substream) =====
{OTHER=Optional[com.cisco.ruan.nio.Dish@5d099f62], FISH=Optional[com.cisco.ruan.nio.Dish@37f8bb67], MEAT=Optional[com.cisco.ruan.nio.Dish@27bc2616]}
===== getMostCaloricByType (collectingAndThen) =====
{OTHER=com.cisco.ruan.nio.Dish@5d099f62, FISH=com.cisco.ruan.nio.Dish@37f8bb67, MEAT=com.cisco.ruan.nio.Dish@27bc2616}
===== getTotalCaloriesByType (summingInt on substream) =====
{OTHER=1550, FISH=750, MEAT=1900}
===== getCaloricLevelsByType (mapping on substream and collect in set) =====
{OTHER=[NORMAL, DIET], FISH=[NORMAL, DIET], MEAT=[NORMAL, DIET, FAT]}
===== getCaloricLevelsByType (mapping on substream and collect in hashset) =====
{OTHER=[NORMAL, DIET], FISH=[NORMAL, DIET], MEAT=[NORMAL, DIET, FAT]}
#+END_EXAMPLE

*** 分区

#+BEGIN_SRC java
  System.out.println("===== getVegetarianDishes (partitioningBy) =====");
  getVegetarianDishes();
  System.out.println("===== getMostCaloricPartitionedByVegetarian (multi-level partitioningBy) =====");
  getMostCaloricPartitionedByVegetarian();
#+END_SRC


#+BEGIN_EXAMPLE
===== getVegetarianDishes (partitioningBy) =====
[com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0, com.cisco.ruan.nio.Dish@5d099f62]
===== getMostCaloricPartitionedByVegetarian (multi-level partitioningBy) =====
{false=pork, true=pizza}
#+END_EXAMPLE




* Lambda

** 知识点

*** 谓词（Predicate）

返回 boolean 的函数


*** 函数式接口（Functional Interface）

只有一个 *抽象* 方法的接口，这种类型的接口也称为 SAM 接口，即 Single Abstract Method interfaces ，主要用在 Lambda 表达式

#+BEGIN_SRC java

@FunctionalInterface
interface MyService {

    void test(String s); // 一个抽象方法

    default void defaultWork() {
        // 函数式接口里可以包含默认方法
    }

    static void printHello(){
        // 函数式接口里可以包含静态方法
    }
}
#+END_SRC

