java/grammar.html


<div id="outline-container-orgec911f8" class="outline-4">
<h4 id="orgec911f8"><span class="section-number-4">2.2.1</span> stream 操作</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-java">System.out.println(<span style="color: #00afaf;">"===== getThreeHighCaloricDishNames (sort) ====="</span>);
getThreeHighCaloricDishNames();
System.out.println(<span style="color: #00afaf;">"===== getDistinctDishType (distinct) ====="</span>);
getDistinctDishType();
System.out.println(<span style="color: #00afaf;">"===== getAllCalories (reduce) ====="</span>);
getAllCalories0();
System.out.println(<span style="color: #00afaf;">"===== getAllCalories (mapToInt) ====="</span>);
getAllCalories1();
System.out.println(<span style="color: #00afaf;">"===== getMaxCalorie (reduce) ====="</span>);
getMaxCalorie();
</pre>
</div>

<pre class="example">
===== getThreeHighCaloricDishNames (sort) =====
pork
beef
pizza
===== getDistinctDishType (distinct) =====
MEAT
OTHER
FISH
===== getAllCalories (reduce) =====
4200
===== getAllCalories (mapToInt) =====
4200
===== getMaxCalorie (reduce) =====
800
</pre>
</div>
</div>


<div id="outline-container-org83ec614" class="outline-4">
<h4 id="org83ec614"><span class="section-number-4">2.2.2</span> 聚合</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-java">System.out.println(<span style="color: #00afaf;">"===== getTotalNumberOfDish (counting) ====="</span>);
getTotalNumberOfDish();
System.out.println(<span style="color: #00afaf;">"===== getMaxCalorie (maxBy) ====="</span>);
getMaxCalorieDish();
System.out.println(<span style="color: #00afaf;">"===== getAllCalories (summingInt) ====="</span>);
getAllCalories2();
System.out.println(<span style="color: #00afaf;">"===== getAverageCalorie (averagingInt) ====="</span>);
getAverageCalorie();
System.out.println(<span style="color: #00afaf;">"===== getStatistics (summarizingInt) ====="</span>);
getStatistics();
System.out.println(<span style="color: #00afaf;">"===== getShortMenu (joining) ====="</span>);
getShortMenu();
</pre>
</div>

<pre class="example">
===== getTotalNumberOfDish (counting) =====
9
===== getMaxCalorie (maxBy) =====
com.cisco.ruan.nio.Dish@27bc2616
===== getAllCalories (summingInt) =====
4200
===== getAverageCalorie (averagingInt) =====
466.6666666666667
===== getStatistics (summarizingInt) =====
IntSummaryStatistics{count=9, sum=4200, min=120, average=466.666667, max=800}
===== getShortMenu (joining) =====
pork, beef, chicken, french fries, rice, season fruit, pizza, prawns, salmon
</pre>
</div>
</div>


<div id="outline-container-org5ee5c59" class="outline-4">
<h4 id="org5ee5c59"><span class="section-number-4">2.2.3</span> 分组</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-java">System.out.println(<span style="color: #00afaf;">"===== groupByCaloricLevel (groupingBy) ====="</span>);
groupByCaloricLevel();
System.out.println(<span style="color: #00afaf;">"===== groupByDishesAndTypeCaloricLevel (multi-level groupingBy) ====="</span>);
groupByDishesAndTypeCaloricLevel();
System.out.println(<span style="color: #00afaf;">"===== groupByDishesAndTypeCaloricLevel (counting on substream) ====="</span>);
getTotalNumberOfDishByType();
System.out.println(<span style="color: #00afaf;">"===== getMostCaloricByType (maxBy on substream) ====="</span>);
getMostCaloricByType0();
System.out.println(<span style="color: #00afaf;">"===== getMostCaloricByType (collectingAndThen) ====="</span>);
getMostCaloricByType1();
System.out.println(<span style="color: #00afaf;">"===== getTotalCaloriesByType (summingInt on substream) ====="</span>);
getTotalCaloriesByType();
System.out.println(<span style="color: #00afaf;">"===== getCaloricLevelsByType (mapping on substream and collect in set) ====="</span>);
getCaloricLevelsByType();
System.out.println(<span style="color: #00afaf;">"===== getCaloricLevelsByType (mapping on substream and collect in hashset) ====="</span>);
getCaloricLevelsByType1();
</pre>
</div>

<pre class="example">
===== groupByCaloricLevel (groupingBy) =====
{NORMAL=[com.cisco.ruan.nio.Dish@179d3b25, com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@5d099f62, com.cisco.ruan.nio.Dish@37f8bb67], DIET=[com.cisco.ruan.nio.Dish@49c2faae, com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0, com.cisco.ruan.nio.Dish@439f5b3d], FAT=[com.cisco.ruan.nio.Dish@27bc2616]}
===== groupByDishesAndTypeCaloricLevel (multi-level groupingBy) =====
{OTHER={NORMAL=[com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@5d099f62], DIET=[com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0]}, FISH={NORMAL=[com.cisco.ruan.nio.Dish@37f8bb67], DIET=[com.cisco.ruan.nio.Dish@439f5b3d]}, MEAT={NORMAL=[com.cisco.ruan.nio.Dish@179d3b25], DIET=[com.cisco.ruan.nio.Dish@49c2faae], FAT=[com.cisco.ruan.nio.Dish@27bc2616]}}
===== groupByDishesAndTypeCaloricLevel (counting on substream) =====
{OTHER=4, FISH=2, MEAT=3}
===== getMostCaloricByType (maxBy on substream) =====
{OTHER=Optional[com.cisco.ruan.nio.Dish@5d099f62], FISH=Optional[com.cisco.ruan.nio.Dish@37f8bb67], MEAT=Optional[com.cisco.ruan.nio.Dish@27bc2616]}
===== getMostCaloricByType (collectingAndThen) =====
{OTHER=com.cisco.ruan.nio.Dish@5d099f62, FISH=com.cisco.ruan.nio.Dish@37f8bb67, MEAT=com.cisco.ruan.nio.Dish@27bc2616}
===== getTotalCaloriesByType (summingInt on substream) =====
{OTHER=1550, FISH=750, MEAT=1900}
===== getCaloricLevelsByType (mapping on substream and collect in set) =====
{OTHER=[NORMAL, DIET], FISH=[NORMAL, DIET], MEAT=[NORMAL, DIET, FAT]}
===== getCaloricLevelsByType (mapping on substream and collect in hashset) =====
{OTHER=[NORMAL, DIET], FISH=[NORMAL, DIET], MEAT=[NORMAL, DIET, FAT]}
</pre>
</div>
</div>

<div id="outline-container-org1159091" class="outline-4">
<h4 id="org1159091"><span class="section-number-4">2.2.4</span> 分区</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-java">System.out.println(<span style="color: #00afaf;">"===== getVegetarianDishes (partitioningBy) ====="</span>);
getVegetarianDishes();
System.out.println(<span style="color: #00afaf;">"===== getMostCaloricPartitionedByVegetarian (multi-level partitioningBy) ====="</span>);
getMostCaloricPartitionedByVegetarian();
</pre>
</div>


<pre class="example">
===== getVegetarianDishes (partitioningBy) =====
[com.cisco.ruan.nio.Dish@254989ff, com.cisco.ruan.nio.Dish@20ad9418, com.cisco.ruan.nio.Dish@31cefde0, com.cisco.ruan.nio.Dish@5d099f62]
===== getMostCaloricPartitionedByVegetarian (multi-level partitioningBy) =====
{false=pork, true=pizza}
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orged76c19" class="outline-2">
<h2 id="orged76c19"><span class="section-number-2">3</span> Lambda</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5a926c1" class="outline-3">
<h3 id="org5a926c1"><span class="section-number-3">3.1</span> 知识点</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org663ca4f" class="outline-4">
<h4 id="org663ca4f"><span class="section-number-4">3.1.1</span> 谓词（Predicate）</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
返回 boolean 的函数
</p>
</div>
</div>


<div id="outline-container-org439b29d" class="outline-4">
<h4 id="org439b29d"><span class="section-number-4">3.1.2</span> 函数式接口（Functional Interface）</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
只有一个 <b>抽象</b> 方法的接口，这种类型的接口也称为 SAM 接口，即 Single Abstract Method interfaces ，主要用在 Lambda 表达式
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">interface</span> <span style="color: #af8700;">MyService</span> {

    <span style="color: #af8700;">void</span> <span style="color: #0087ff;">test</span>(<span style="color: #af8700;">String</span> <span style="color: #0087ff;">s</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#19968;&#20010;&#25277;&#35937;&#26041;&#27861;</span>

    <span style="color: #5f8700;">default</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">defaultWork</span>() {
        <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#20989;&#25968;&#24335;&#25509;&#21475;&#37324;&#21487;&#20197;&#21253;&#21547;&#40664;&#35748;&#26041;&#27861;</span>
    }

    <span style="color: #5f8700;">static</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">printHello</span>(){
        <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#20989;&#25968;&#24335;&#25509;&#21475;&#37324;&#21487;&#20197;&#21253;&#21547;&#38745;&#24577;&#26041;&#27861;</span>
    }
}
</pre>
</div>
</div>
</div>
