java/grammar.org
*** 常见函数式接口

- Comparable (T, T) -> int

  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Comparator<T> {
        int compare(T o1, T o2);
    }
  #+END_SRC

- Runnable () -> void
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Runnable {
        public abstract void run();
    }
  #+END_SRC

- Callable () -> T
  #+BEGIN_SRC java
    public interface Callable<V> {
        V call() throws Exception;
    }
  #+END_SRC

- Predicate (T) -> boolean
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Predicate<T>{
        boolean test(T t);
    }
  #+END_SRC

- BiPredicate (T, U) -> boolean

  #+BEGIN_SRC java
    @FunctionalInterface
    public interface BiPredicate<T, U> {
        boolean test(T t, U u);
    }
  #+END_SRC

- Consumer (T) -> void
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Consumer<T>{
        void accept(T t);
    }
  #+END_SRC

- BiConsumer (T, U) -> void
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface BiConsumer<T, U> {
        void accept(T t, U u);
    }
  #+END_SRC

- Function (T) -> R
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Function<T, R>{
        R apply(T t);
    }
  #+END_SRC

- UnaryOperator (T) -> T

  Function<T, T>

- BiFunction (T, U) -> R

  #+BEGIN_SRC java
    @FunctionalInterface
    public interface BiFunction<T, U, R> {
        R apply(T t, U u);
    }
  #+END_SRC

- BinaryOperator (T, T) -> T

  BiBunction<T, T, T>

- Supplier () -> T
  #+BEGIN_SRC java
    @FunctionalInterface
    public interface Supplier<T> {
        T get();
    }
  #+END_SRC



*** 方法引用

| 方法引用                  | Lambda 表达式                           |
| ClassName::staticMethod   | (args) -> ClassName.staticMethod(args)  |
| ClassName::instanceMethod | (ins, args) -> ins.instanceMethod(args) |
| expr::instanceMethod      | (args) -> expr.instanceMethod(args)     |


*** 构造方法引用

对于一个现有构造函数，可以利用它的名称和关键字 new 来创建它的一个引用: ClassName::new \\
它的功能与指向静态方法的引用类似


*** 类型检查与推断

- Lambda 的类型是从使用 Lambda 的上下文推断出来的
- 同一个 Lambda 表达式就可以与不同的函数式接口联系起来，只要它们的抽象方法签名能够兼容
- Java 编译器会从上下文（目标类型）推断出用什么函数式接口来配合 Lambda 表达式


*** 特殊的 void 兼容规则

如果一个 Lambda 的主体是一个语句表达式，它就和一个返回 void 的函数描述符兼容。\\
例如，以下两行都是合法的，尽管 List 的 add 方法返回了一个 boolean ，而不是 Consumer 上下文 (T -> void) 所要求的 void :

#+BEGIN_SRC java
  Predicate<String> p = s -> list.add(s);

  Consumer<String> b = s -> list.add(s);
#+END_SRC


** 示例代码

*** 方法引用

#+BEGIN_SRC java
  str.sort((s1, s2) -> s1.compareToIgnoreCase(s2)); // =>
  str.sort(String::compareToIgnoreCase);

  Function<String, Integer> stringToInteger =
      (String s) -> Integer.parseInt(s); // =>
  Function<String, Integer> stringToInteger = Integer::parseInt;

  BiPredicate<List<String>, String> contains =
      (list, element) -> list.contains(element); // =>
  BiPredicate<List<String>, String> contains = List::contains;
#+END_SRC

*** 构造方法引用

#+BEGIN_SRC java
  Supplier<Apple> a = () -> new Apple(); // =>
  Supplier<Apple> a = Apple::new;

  Function<Integer,Apple> a = (weight) -> new Apple(weight); // =>
  Function<Integer,Apple> a = Apple::new;

  BiFunction<String, Integer, Apple> c3 =
      (color, weight) -> new Apple(color, weight); // =>
  BiFunction<String, Integer, Apple> c3 = Apple::new;
#+END_SRC

