java/grammar.html

<div id="outline-container-org2559485" class="outline-4">
<h4 id="org2559485"><span class="section-number-4">3.1.3</span> 常见函数式接口</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li><p>
Comparable (T, T) -&gt; int
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Comparator</span>&lt;<span style="color: #af8700;">T</span>&gt; {
    <span style="color: #af8700;">int</span> <span style="color: #0087ff;">compare</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">o1</span>, <span style="color: #af8700;">T</span> <span style="color: #0087ff;">o2</span>);
}
</pre>
</div></li>

<li><p>
Runnable () -&gt; void
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Runnable</span> {
    <span style="color: #5f8700;">public</span> <span style="color: #5f8700;">abstract</span> <span style="color: #af8700;">void</span> <span style="color: #0087ff;">run</span>();
}
</pre>
</div></li>

<li><p>
Callable () -&gt; T
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Callable</span>&lt;<span style="color: #af8700;">V</span>&gt; {
    <span style="color: #af8700;">V</span> <span style="color: #0087ff;">call</span>() <span style="color: #5f8700;">throws</span> <span style="color: #af8700;">Exception</span>;
}
</pre>
</div></li>

<li><p>
Predicate (T) -&gt; boolean
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Predicate</span>&lt;<span style="color: #af8700;">T</span>&gt;{
    <span style="color: #af8700;">boolean</span> <span style="color: #0087ff;">test</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>);
}
</pre>
</div></li>

<li><p>
BiPredicate (T, U) -&gt; boolean
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">BiPredicate</span>&lt;<span style="color: #af8700;">T</span>, <span style="color: #af8700;">U</span>&gt; {
    <span style="color: #af8700;">boolean</span> <span style="color: #0087ff;">test</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>, <span style="color: #af8700;">U</span> <span style="color: #0087ff;">u</span>);
}
</pre>
</div></li>

<li><p>
Consumer (T) -&gt; void
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Consumer</span>&lt;<span style="color: #af8700;">T</span>&gt;{
    <span style="color: #af8700;">void</span> <span style="color: #0087ff;">accept</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>);
}
</pre>
</div></li>

<li><p>
BiConsumer (T, U) -&gt; void
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">BiConsumer</span>&lt;<span style="color: #af8700;">T</span>, <span style="color: #af8700;">U</span>&gt; {
    <span style="color: #af8700;">void</span> <span style="color: #0087ff;">accept</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>, <span style="color: #af8700;">U</span> <span style="color: #0087ff;">u</span>);
}
</pre>
</div></li>

<li><p>
Function (T) -&gt; R
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">T</span>, <span style="color: #af8700;">R</span>&gt;{
    <span style="color: #af8700;">R</span> <span style="color: #0087ff;">apply</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>);
}
</pre>
</div></li>

<li><p>
UnaryOperator (T) -&gt; T
</p>

<p>
Function&lt;T, T&gt;
</p></li>

<li><p>
BiFunction (T, U) -&gt; R
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">BiFunction</span>&lt;<span style="color: #af8700;">T</span>, <span style="color: #af8700;">U</span>, <span style="color: #af8700;">R</span>&gt; {
    <span style="color: #af8700;">R</span> <span style="color: #0087ff;">apply</span>(<span style="color: #af8700;">T</span> <span style="color: #0087ff;">t</span>, <span style="color: #af8700;">U</span> <span style="color: #0087ff;">u</span>);
}
</pre>
</div></li>

<li><p>
BinaryOperator (T, T) -&gt; T
</p>

<p>
BiBunction&lt;T, T, T&gt;
</p></li>

<li><p>
Supplier () -&gt; T
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">@FunctionalInterface</span>
<span style="color: #5f8700;">public</span> <span style="color: #5f8700;">interface</span> <span style="color: #af8700;">Supplier</span>&lt;<span style="color: #af8700;">T</span>&gt; {
    <span style="color: #af8700;">T</span> <span style="color: #0087ff;">get</span>();
}
</pre>
</div></li>
</ul>
</div>
</div>



<div id="outline-container-org99ec167" class="outline-4">
<h4 id="org99ec167"><span class="section-number-4">3.1.4</span> 方法引用</h4>
<div class="outline-text-4" id="text-3-1-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">方法引用</td>
<td class="org-left">Lambda 表达式</td>
</tr>

<tr>
<td class="org-left">ClassName::staticMethod</td>
<td class="org-left">(args) -&gt; ClassName.staticMethod(args)</td>
</tr>

<tr>
<td class="org-left">ClassName::instanceMethod</td>
<td class="org-left">(ins, args) -&gt; ins.instanceMethod(args)</td>
</tr>

<tr>
<td class="org-left">expr::instanceMethod</td>
<td class="org-left">(args) -&gt; expr.instanceMethod(args)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org1ba5de4" class="outline-4">
<h4 id="org1ba5de4"><span class="section-number-4">3.1.5</span> 构造方法引用</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
对于一个现有构造函数，可以利用它的名称和关键字 new 来创建它的一个引用: ClassName::new <br>
它的功能与指向静态方法的引用类似
</p>
</div>
</div>


<div id="outline-container-orge2e15a8" class="outline-4">
<h4 id="orge2e15a8"><span class="section-number-4">3.1.6</span> 类型检查与推断</h4>
<div class="outline-text-4" id="text-3-1-6">
<ul class="org-ul">
<li>Lambda 的类型是从使用 Lambda 的上下文推断出来的</li>
<li>同一个 Lambda 表达式就可以与不同的函数式接口联系起来，只要它们的抽象方法签名能够兼容</li>
<li>Java 编译器会从上下文（目标类型）推断出用什么函数式接口来配合 Lambda 表达式</li>
</ul>
</div>
</div>


<div id="outline-container-orgda08c36" class="outline-4">
<h4 id="orgda08c36"><span class="section-number-4">3.1.7</span> 特殊的 void 兼容规则</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
如果一个 Lambda 的主体是一个语句表达式，它就和一个返回 void 的函数描述符兼容。<br>
例如，以下两行都是合法的，尽管 List 的 add 方法返回了一个 boolean ，而不是 Consumer 上下文 (T -&gt; void) 所要求的 void :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Predicate</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">p</span> = s -&gt; list.add(s);

<span style="color: #af8700;">Consumer</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">b</span> = s -&gt; list.add(s);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd362c17" class="outline-3">
<h3 id="orgd362c17"><span class="section-number-3">3.2</span> 示例代码</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org0a17f77" class="outline-4">
<h4 id="org0a17f77"><span class="section-number-4">3.2.1</span> 方法引用</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-java">str.sort((s1, s2) -&gt; s1.compareToIgnoreCase(s2)); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
str.sort(String::compareToIgnoreCase);

<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">String</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">stringToInteger</span> =
    (String <span style="color: #af8700;">s</span>) -&gt; Integer.parseInt(s); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">String</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">stringToInteger</span> = Integer::parseInt;

<span style="color: #af8700;">BiPredicate</span>&lt;<span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">String</span>&gt;, <span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">contains</span> =
    (list, element) -&gt; list.contains(element); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
<span style="color: #af8700;">BiPredicate</span>&lt;<span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">String</span>&gt;, <span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">contains</span> = List::contains;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaefdc8d" class="outline-4">
<h4 id="orgaefdc8d"><span class="section-number-4">3.2.2</span> 构造方法引用</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Supplier</span>&lt;<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">a</span> = () -&gt; <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Apple</span>(); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
<span style="color: #af8700;">Supplier</span>&lt;<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">a</span> = Apple::<span style="color: #5f8700;">new</span>;

<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>,<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">a</span> = (weight) -&gt; <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Apple</span>(weight); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>,<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">a</span> = Apple::<span style="color: #5f8700;">new</span>;

<span style="color: #af8700;">BiFunction</span>&lt;<span style="color: #af8700;">String</span>, <span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">c3</span> =
    (color, weight) -&gt; <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Apple</span>(color, weight); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">=&gt;</span>
<span style="color: #af8700;">BiFunction</span>&lt;<span style="color: #af8700;">String</span>, <span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">c3</span> = Apple::<span style="color: #5f8700;">new</span>;
</pre>
</div>
</div>
</div>
