java/grammar.org
*** 排序

#+BEGIN_SRC java
  // Comparator 具有一个叫作 comparing 的静态辅助方法，
  // 它可以接受一个 Function 来提取 Comparable 键值，并生成一个 Comparator 对象
  import static java.util.Comparator.comparing;
  inventories.sort(comparing((a) -> a.getWeight()));
  inventories.sort(comparing(Apple::getWeight));

  inventories.sort(comparing(Apple::getWeight).reversed()); // 逆序

  inventories.sort(comparing(Apple::getWeight).thenComparing(Apple::getColour)); // 比较器链
#+END_SRC

*** 谓词复合 (negate, and, or)

and 和 or 方法是按照在表达式链中的位置，从左向右确定优先级的。

=a.or(b).and(c)= 可以看作 =(a || b) && c=

#+BEGIN_SRC java
  Predicate<Apple> notRedApple = redApple.negate();

  Predicate<Apple> redAndHeavyApple =
      redApple.and(a -> a.getWeight() > 150);

  Predicate<Apple> redAndHeavyAppleOrGreen =
      redApple.and(a -> a.getWeight() > 150)
      .or(a -> "green".equals(a.getColor()));
#+END_SRC

*** 函数复合

#+BEGIN_SRC java
  // andThen: g(f(x))
  Function<Integer, Integer> f = x -> x + 1;
  Function<Integer, Integer> g = x -> x * 2;
  Function<Integer, Integer> h = f.andThen(g);
  int result = h.apply(1); // 4

  // compose: f(g(x))
  Function<Integer, Integer> f = x -> x + 1;
  Function<Integer, Integer> g = x -> x * 2;
  Function<Integer, Integer> h = f.compose(g);
  int result = h.apply(1); // 3
#+END_SRC



* Optional

** 基本原理

不推荐使用基础类型的 Optional ，因为基础类型的 Optional 不支持map，flatMap 以及 filter 方法，
而这些却是 Optional 类最有用的方法。


** 代码示例

*** 类三元操作符

以不解包的方式组合两个 Optional 对象，用一行语句实现条件判断的结构：

#+BEGIN_SRC java
  public Optional<Insurance> nullSafeFindCheapestInsurance(Optional<Person> person, Optional<Car> car) {
      return person.flatMap(p -> car.map(c -> findCheapestInsurance(p, c)));
  }
#+END_SRC


*** 避免在 Null 对象上调用 stream()

#+BEGIN_SRC java
  org.apache.commons.collections4.CollectionUtils.emptyIfNull(list)
      .stream()
      .filter(...);
#+END_SRC
