java/grammar.html

<div id="outline-container-org7dd9917" class="outline-4">
<h4 id="org7dd9917"><span class="section-number-4">3.2.3</span> 排序</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">Comparator &#20855;&#26377;&#19968;&#20010;&#21483;&#20316; comparing &#30340;&#38745;&#24577;&#36741;&#21161;&#26041;&#27861;&#65292;</span>
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#23427;&#21487;&#20197;&#25509;&#21463;&#19968;&#20010; Function &#26469;&#25552;&#21462; Comparable &#38190;&#20540;&#65292;&#24182;&#29983;&#25104;&#19968;&#20010; Comparator &#23545;&#35937;</span>
<span style="color: #5f8700;">import</span> <span style="color: #5f8700;">static</span> <span style="color: #00afaf;">java</span>.<span style="color: #00afaf;">util</span>.Comparator.<span style="color: #af8700;">comparing</span>;
inventories.sort(comparing((a) -&gt; a.getWeight()));
inventories.sort(comparing(Apple::getWeight));

inventories.sort(comparing(Apple::getWeight).reversed()); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#36870;&#24207;</span>

inventories.sort(comparing(Apple::getWeight).thenComparing(Apple::getColour)); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">&#27604;&#36739;&#22120;&#38142;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaeb9ba5" class="outline-4">
<h4 id="orgaeb9ba5"><span class="section-number-4">3.2.4</span> 谓词复合 (negate, and, or)</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
and 和 or 方法是按照在表达式链中的位置，从左向右确定优先级的。
</p>

<p>
<code>a.or(b).and(c)</code> 可以看作 <code>(a || b) &amp;&amp; c</code>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Predicate</span>&lt;<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">notRedApple</span> = redApple.negate();

<span style="color: #af8700;">Predicate</span>&lt;<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">redAndHeavyApple</span> =
    redApple.and(a -&gt; a.getWeight() &gt; 150);

<span style="color: #af8700;">Predicate</span>&lt;<span style="color: #af8700;">Apple</span>&gt; <span style="color: #0087ff;">redAndHeavyAppleOrGreen</span> =
    redApple.and(a -&gt; a.getWeight() &gt; 150)
    .or(a -&gt; <span style="color: #00afaf;">"green"</span>.equals(a.getColor()));
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8f6fe6" class="outline-4">
<h4 id="orgd8f6fe6"><span class="section-number-4">3.2.5</span> 函数复合</h4>
<div class="outline-text-4" id="text-3-2-5">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">andThen: g(f(x))</span>
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">f</span> = x -&gt; x + 1;
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">g</span> = x -&gt; x * 2;
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">h</span> = f.andThen(g);
<span style="color: #af8700;">int</span> <span style="color: #0087ff;">result</span> = h.apply(1); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">4</span>

<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">compose: f(g(x))</span>
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">f</span> = x -&gt; x + 1;
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">g</span> = x -&gt; x * 2;
<span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">Integer</span>, <span style="color: #af8700;">Integer</span>&gt; <span style="color: #0087ff;">h</span> = f.compose(g);
<span style="color: #af8700;">int</span> <span style="color: #0087ff;">result</span> = h.apply(1); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">3</span>
</pre>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-org9fd843a" class="outline-2">
<h2 id="org9fd843a"><span class="section-number-2">4</span> Optional</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0492ed8" class="outline-3">
<h3 id="org0492ed8"><span class="section-number-3">4.1</span> 基本原理</h3>
<div class="outline-text-3" id="text-4-1">
<p>
不推荐使用基础类型的 Optional ，因为基础类型的 Optional 不支持map，flatMap 以及 filter 方法，
而这些却是 Optional 类最有用的方法。
</p>
</div>
</div>


<div id="outline-container-orgec382c4" class="outline-3">
<h3 id="orgec382c4"><span class="section-number-3">4.2</span> 代码示例</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org71fee27" class="outline-4">
<h4 id="org71fee27"><span class="section-number-4">4.2.1</span> 类三元操作符</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
以不解包的方式组合两个 Optional 对象，用一行语句实现条件判断的结构：
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5f8700;">public</span> <span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Insurance</span>&gt; <span style="color: #0087ff;">nullSafeFindCheapestInsurance</span>(<span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Person</span>&gt; <span style="color: #0087ff;">person</span>, <span style="color: #af8700;">Optional</span>&lt;<span style="color: #af8700;">Car</span>&gt; <span style="color: #0087ff;">car</span>) {
    <span style="color: #5f8700;">return</span> person.flatMap(p -&gt; car.map(c -&gt; findCheapestInsurance(p, c)));
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org66a2f78" class="outline-4">
<h4 id="org66a2f78"><span class="section-number-4">4.2.2</span> 避免在 Null 对象上调用 stream()</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">org</span>.<span style="color: #00afaf;">apache</span>.<span style="color: #00afaf;">commons</span>.<span style="color: #00afaf;">collections4</span>.CollectionUtils.emptyIfNull(list)
    .stream()
    .filter(...);
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>